WEB_APP/load-test.yml
# Artillery 负载测试配置
# 测试应用在高并发下的表现
# 运行: artillery run load-test.yml

config:
  target: 'http://localhost:3000'  # 改为你的URL
  phases:
    # 阶段1: 预热 (60秒，每秒10个新用户)
    - duration: 60
      arrivalRate: 10
      name: "预热阶段"
    
    # 阶段2: 逐步增加 (120秒，每秒50个新用户)
    - duration: 120
      arrivalRate: 50
      name: "逐步增加"
    
    # 阶段3: 高负载 (60秒，每秒100个新用户)
    - duration: 60
      arrivalRate: 100
      name: "高负载测试"
    
    # 阶段4: 峰值测试 (30秒，每秒200个新用户)
    - duration: 30
      arrivalRate: 200
      name: "峰值测试"

  # 性能阈值
  ensure:
    maxErrorRate: 1        # 最大错误率1%
    p99: 2000              # P99延迟 < 2秒
    p95: 1000              # P95延迟 < 1秒

scenarios:
  # 场景1: 访问课程注册页面（最常见）
  - name: "查看课程注册记录"
    weight: 70            # 70%的流量
    flow:
      - get:
          url: "/api/test-cache"
          capture:
            - json: "$.success"
              as: "success"
      - think: 1          # 思考时间1秒
      - get:
          url: "/api/admin/enrollments"
          headers:
            Cookie: "next-auth.session-token=test"
          expect:
            - statusCode: [200, 401]  # 200或401都可以

  # 场景2: 访问统计页面
  - name: "查看统计数据"
    weight: 20            # 20%的流量
    flow:
      - get:
          url: "/admin"
      - think: 2

  # 场景3: 搜索和过滤
  - name: "搜索学生"
    weight: 10            # 10%的流量
    flow:
      - get:
          url: "/api/admin/students?search=test"
          headers:
            Cookie: "next-auth.session-token=test"
      - think: 1